spec/dummy/app/controllers/phone_numbers_controller.rb

SELECT "phone_numbers".* FROM "phone_numbers"
---
  def index
    @objects = @phone_numbers = PhoneNumber.all

INSERT INTO "phone_numbers" ("number", "active", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["number", "(123)456-7890"], ["active", 1], ["person_id", 1], ["created_at", "2025-06-10 00:38:54.125231"], ["updated_at", "2025-06-10 00:38:54.125231"]]
---
  def create
    @object = @phone_number = PhoneNumber.new(phone_number_params)

    if @phone_number.save

UPDATE "phone_numbers" SET "number" = ?, "active" = ?, "updated_at" = ? WHERE "phone_numbers"."id" = ?  [["number", "(811)643-8997"], ["active", 0], ["updated_at", "2025-06-10 00:41:10.379519"], ["id", 4]]
---
  def update
    if @phone_number.update(phone_number_params)

DELETE FROM "phone_numbers" WHERE "phone_numbers"."id" = ?  [["id", 4]]
---
  def destroy
    @phone_number.destroy!

SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_phone_number
      @object = @phone_number = PhoneNumber.find(params.expect(:id))